class Criterion:
    """
    The DataClass to store ISS criterion
    Returns:
        criterion {dict} -- ISS criterion
    """
    def __init__(self):
        self.criterion = {
            "头颈部":{
                "颈部":{
                    '1':["颈(内|外)静脉损","颈外静脉(轻度|浅表|穿孔|穿刺)","(颈部|迷走)神经损","颈部穿透","甲状腺(挫伤|血肿)","棘间韧带拉伤","颈椎急性扭","颈部外伤"],
                    '2':["颈(部|外)椎动脉(损|内膜撕裂|轻度|浅表|穿孔|穿刺)","颈外动脉(血栓|闭塞)","颈内静脉(轻度|浅表|穿孔|穿刺)","颈部穿透伤伴组织缺失>100","颈段食管(NFS|挫伤|血肿)","喉(NFS|挫伤|血肿|非全层|穿刺伤未穿孔|粘膜撕裂)","(咽|咽后)(NFS|血肿|轻度挫伤|挫伤气道受累≤75)","唾液腺损伤NFS","甲状腺裂伤","颈段气管(NFS|血肿|挫|非全层)","声带(NFS|单侧)","穹隆骨折(NFS|闭合|无移位|裂缝|线型)","舌骨骨折","颈椎间盘损伤(NFS|突出|半脱位|脱位)","单侧小关节突(脱位|半脱位)","颈椎骨折NFS","C.{0,6}椎体骨折","椎体前部压缩≤20","颈(棘突|横突|小关节突|椎板|椎弓根)骨折"],
                    '3':["(颈总|颈部|颈内)动脉损伤(NFS|内膜撕裂|轻度|浅表|穿孔|穿刺)","(颈部椎|颈外)动脉(重度|破裂|横断|节段性缺损|失血>20)","(颈内|外)静脉(重度|破裂|横断|节段性缺损|失血>20)","(颈总|颈部|颈内)动脉(内膜撕裂|血栓|闭塞|轻度|浅表|穿孔|穿刺)","(颈部椎动脉|颈外动脉|颈内静脉|颈外静脉)(重度|破裂|横断|节段性缺损|失血>20%)","颈部椎动脉(内膜撕裂|轻度|浅表|穿孔|穿刺)","颈部穿透伤伴失血>20","颈段食管(NFS|非全层裂伤|裂伤≤50)","(喉穿孔|全层裂伤)","(咽|咽后)重度(挫伤|挫伤气道受累>75|非全层裂伤|穿刺伤未穿孔|粘膜裂伤)","唾液腺管(受累|横断)","颈段气管(穿孔|全层裂伤|折断)","双侧声带损伤","穹隆骨折(粉碎|哆开|移位|凹陷≤2)","颅底骨折(NFS|有无脑脊液漏|无脑脊液漏)","颅骨穿透伤(NFS|深度≤2)","颅腔积气","颈椎间盘突出伴神经根损伤","椎间盘破裂","(寰枢|齿状突|寰枕)关节脱位","双侧小关节突(脱位|半脱位)","椎体前部压缩>20|齿状突骨折"],
                    '4':["(基底动脉|乙状窦|直窦)损伤","颈动脉-海绵状血管瘘","(颈总|颈部|颈内)动脉.*(重度|破裂|横断|节段性缺损|失血>20)","(颈总|颈部|颈内)动脉(内膜撕裂|血栓|闭塞|轻度|浅表|穿孔|穿刺)","颈部椎动脉损伤.*(重度|破裂|横断|失血>20)","双侧颈部膈神经损伤","双侧完全性臂丛损伤","不全性脊髓损伤","颈段食管(穿孔|全层裂伤|裂伤)","吞咽性损伤管壁全层坏死","喉(裂|穿刺)","(咽|咽后)(穿孔|全层裂伤)","颈段气管(撕脱|破裂|横断|广泛毁损)","喉-气管分离"],
                    '5':["(基底动脉|直窦|上矢状窦后部|双侧大脑中|颅内椎动脉|颈内椎动脉|颈部椎动脉|乙状窦|横窦)(血栓|闭塞)","基底动脉创伤性动脉瘤","(颈总|颈部|颈内)动脉(重度|破裂|横断|节段性缺损失血>20)","双侧颈部椎动脉(重度|破裂|横断|失血>20)","完全性脊髓损伤","(颈段食管|喉|咽|咽后)(撕脱|破裂|横断|广泛毁损)"],
                    '6':["双侧(颅内动脉|颈内动脉|颅内椎动脉|乙状窦)裂伤","双侧开放性的横窦裂伤","横窦窦汇开放性裂伤","颈髓损伤","颈段脊髓损伤"]
                    },
                "颅脑":{
                    '1':["头.{0,6}外伤","脑震荡.*(NFS|无意识丧失)"],
                    '2':["脑神经(挫|裂)","颈部膈神经损","臂丛(NFS|不全|神经损伤)","颈.{0,3}神经根(NFS|挫伤|牵拉|损伤)","(小|大)脑挫伤直径<1cm","小脑硬膜(外|下)血肿厚度<0.6cm","小脑内血肿直径<0.6cm","(蛛网膜下腔|软脑膜)出血","大脑内血肿直径<1","大脑皮质下出血(无昏迷|昏迷≤6)","大脑硬膜外血肿厚度<0.6","(大脑蛛网膜下腔|软脑膜下出血).*(NFS|无昏迷|昏迷≤6)","脑室内出血.*(无昏迷|昏迷≤6)","脑震荡意识丧失<1","硬膜下血肿"],
                    '3':["脑(挫|裂|挫裂)","颅骨骨折","颅内血肿","脑出血","颅血管损伤","大脑(前|中|后|基底|颅内椎动脉)(血栓|闭塞)","大脑(前|后|颅内椎|颈总|颈部|颈内|颅内|颈内).*动脉(血栓|闭塞|瘤)","海绵窦(血栓|闭塞)","双侧(VII|VIII)脑神经(挫|裂)","完全性臂丛损伤","颈髓挫伤NFS","多根神经(根裂伤|撕脱)","(大脑|小脑)内(血肿|出血)","(大脑|小脑)硬膜(外|下)(血肿|出血)","大脑(蛛网膜下腔|软脑膜下)出血.*(无昏迷|昏迷≤6)","脑(肿胀|水肿)(NFS|轻度)","缺血性脑损伤.*(无昏迷|昏迷≤6)"],
                    '4':["(海绵窦|乙状窦|直窦|上矢状窦|横窦)裂伤","大脑(前|中|后|基底|颅内椎)动脉裂伤","(大脑中|颅内|颈内|颈部椎动脉|乙状窦|上矢状窦前部|横窦|大脑前|后|颅内椎动脉)(血栓|闭塞)","中度脑(肿胀|水肿)","脑室内出血伴昏迷>6","大脑弥漫性轴突损伤NFS","开放性伴脑组织外露","丢失的(穹隆|颅底)骨折","穹隆骨折凹陷＞2"],
                    '5':["(大脑前|大脑中|大脑后|大脑基底|颅内|颈内|颅内椎)动脉裂伤","开放性(海绵窦|乙状窦|直窦|上矢状窦|横窦)裂伤","双侧(乙状窦|横窦)裂伤","瘫痪","截瘫","脑干(NFS|挫伤|梗塞|出血|压迫)","重度脑(肿胀|水肿)","(脑室|脑干池)消失","大脑弥漫性轴突损伤","缺血性脑损伤伴昏迷","颅骨穿透伤深度>2"],
                    '6':["脑干(裂|挤压毁损|穿透|横断)","头部离断","颅脑广泛毁损"]
                }
            },
            "面部":{
                "面部":{
                    '1':["面部.{0,3}外伤","颈外动脉分支(NFS|轻度)","耳损伤NFS","耳道损伤","(内耳|中耳)损伤导致(眩晕|耳鸣)","听骨链脱位","鼓膜破裂","前庭器官损伤","眼损伤","(口腔|腭|齿龈)(挫|裂|撕脱)","舌轻度裂伤","穿透伤(NFS|浅表|轻度)","面部骨折","下颌骨闭合性骨折","鼻闭合性骨折","鼻衄","牙齿损伤","颧骨骨折.*(I|II|III|IV|V)"],
                    '2':["视神经眶内段(NFS|挫|裂|撕脱)","双侧(内耳|中耳)损伤","双侧听骨链脱位","眼(撕脱|剜出)","黄斑裂孔","巩膜裂伤","舌(深部|广泛)裂","颞颌关节脱位","穿透伤伴组织缺失>100","齿槽嵴骨折","下颌骨(开放|明显移位|粉碎性骨折)","上颌骨骨折.*(I|II)","鼻(开放|明显移位|粉碎性骨折)","鼻中隔骨折","颧骨骨折.*VI"],
                    '3':["颈外动脉分支重度裂伤.*伴失血","双侧视神经眶内段(裂|撕脱)","双侧眼(撕脱|剜出)","穿透伤伴失血","上颌骨骨折.*III","眼眶骨折","全面部骨折"],
                    '4':["全面部广泛毁损","上颌骨骨折失血>20","全面部骨折失血>20"],
                    '5':[],
                    '6':[]
                    }
            },
            "胸部":{
                "胸部":{
                    '1':["(胸廓|胸壁|胸骨)(NFS|挫伤)","胸.{5}(穿透伤NFS|浅表|轻度)","支气管主干远端(NFS|挫伤|血肿)","心脏(NFS|轻度)","迷走神经损伤","棘间韧带裂伤","胸椎急性扭伤"],
                    '2':["胸骨骨折","肋骨骨折","多发.{0,3}肋骨骨折","2根肋骨骨折","女性乳房撕脱伤","穿透伤伴组织缺失"," (胸膜|胸导管)裂伤","气胸","纵隔积(血|气)","支气管主干远端(未穿孔裂伤|非全层撕裂)","单肺挫伤轻度","肺吸入性损伤","(膈肌|胸段食管)(NFS|挫伤|血肿)","心包(NFS|裂|穿刺)","(支气管|食管|肋间|乳内)(NFS|内膜撕裂|轻度|浅表|穿孔|穿刺)","(奇|半奇|乳内|支气管|食管|肋间|胸段颈内)静脉(NFS|轻度|穿孔|穿刺)","神经根(NFS|挫伤|牵拉|单根裂伤|单根撕脱)","胸椎间盘损伤(NFS|突出|半脱位|脱位)","单侧小关节突(脱位|半脱位)","胸.{0,3}椎.{0,3}骨折","T.{0,5}骨折","椎体前部压缩≤20","胸(棘突|横突|小关节突|椎板|椎弓根)骨折"],
                    '3':["(3|4|5|6|7|8|9|10|11|12)肋.{0,6}骨折","单侧连枷胸","穿透伤伴(血|气胸|失血>20)","血胸NFS","纵隔积气伴心包填塞","(支气管主干|胸段气管)(NFS|挫|血肿|未穿孔裂伤|非全层撕裂)","支气管主干远端(穿孔|全层撕裂|折断)","肺(NFS|轻度爆震伤)","单肺挫伤(重度|伴低氧血症|伴A-a梯度增高)","肺挫伤","肺吸入性损伤.*(轻度红斑|片状红斑|轻度支气管出血)","膈肌裂伤≤10","胸段食管(NFS|非全层)裂伤","吞咽性损伤管壁非全层坏死","心脏裂伤(未穿孔|未累及房室)","心包积血(NFS|无心包填塞|无心脏损伤)","(头臂|锁骨下|肺)(动脉|静脉)(NFS|轻度|浅表|穿孔|穿刺)","胸段腔静脉(NFS|轻度|浅表|穿孔|穿刺)","(头臂|锁骨下|肺)动脉内膜撕裂","(支气管|食管|肋间|乳内)动脉(重度裂伤|破裂|完全横断|节段性缺损|失血>20)","(奇|半奇|乳内|支气管|食管|肋间|胸段颈内)静脉(重度裂伤|破裂|完全横断|节段性缺损|失血>20)","脊髓挫伤(NFS|伴)","多根神经根(裂伤|撕脱)","胸椎间盘突出伴神经根损伤","椎间盘破裂","双侧小关节突(脱位|半脱位)","椎体前部压缩>20","胸椎.{0,3}压缩.{0,3}骨折","T.{0,6}椎.{0,3}压缩.{0,3}骨折"],
                    '4':["胸壁轻度撕脱伤","(单|左|右)侧(6|7|8|9|10|11|12)根肋骨骨折伴连枷胸","(开放性|吸吮性)胸部伤","重度(血|气|血气)胸","(支气管主干|胸段气管)(穿孔|全层撕裂|折断)","支气管主干远端(复杂性裂伤|撕脱|破裂|横断|分离)","肺爆震伤(中度|伴出血)","(双肺挫伤|单肺裂伤)(重度|伴低氧血症|伴A-a梯度增高)","双肺(挫伤|裂伤)","双肺裂伤(轻度|A-a梯度增高)","中度含碳物沉积","中度红斑","中度支气管出血","膈肌裂伤(伴明显组织缺失|破裂)伴膈疝","胸段食管(穿孔|全层裂伤|裂伤)","吞咽性损伤管壁全层坏死","心脏重度挫伤","心包积血伴心包填塞但无心脏损伤","胸主动脉(NFS|内膜撕裂|轻度|浅表|穿孔|穿刺)","(头臂|锁骨下)(动|静)脉重度(裂|破裂|完全横断|节段性缺损|失血>20)","胸段腔静脉重度(裂|破裂|完全横断|节段性缺损|失血>20)","脊髓挫伤致不全性脊髓损伤综合征"],
                    '5':["胸壁重度度撕脱伤","双侧连枷胸","张力性气胸","空气栓塞","支气管主干(复杂性裂|撕脱|破裂|横断|分离)","胸段气管(撕脱|破裂|横断|广泛毁损)","喉-气分离","重度肺爆震伤","双肺爆震伤伴气栓","双肺裂伤(重度|伴低氧血症|伴A-a梯度增高)","重度炎症伴脆性","重度支气管出血","支气管堵塞","低氧血症","胸段食管(撕脱|破裂|横断|广泛毁损)","心(房|室)穿孔","心房破裂","心(内瓣膜|房|室间隔|腱索)(裂伤|破裂)","心包疝","胸主动脉内膜撕裂累及主动脉瓣","(胸主动脉|肺动|肺静)脉重度(裂伤|破裂|完全横断|节段性缺损|失血>20)","冠脉裂伤","冠脉(左主干|右主干|左前降支)冠状窦血栓形成","(头臂静脉|胸段腔静脉)重度裂伤伴肺气栓","脊髓挫伤致完全性脊髓损伤综合征","脊髓裂伤(NFS|穿透伤|横断|挤压)"],
                    '6':["广泛挤压毁损","肺吸入性损伤伴粘膜(脱落|坏死|内皮消失)","心室破裂","多发性心(房|室)裂伤","(左|右)心(房|室)组织缺损>50","心脏撕脱","胸主动脉裂伤伴","双侧肺(动|静)脉(重度裂伤|破裂|完全横断|节段性缺损|失血>20)"]
                    }
            },
            "腹部":{
                "脏器":{
                    '1':["肾上腺(NFS|轻度|浅表|裂|血肿)","(肛门|前列腺|子宫)(NFS|挫伤|血肿)","膀胱(挫伤|血肿)","卵巢(NFS|挫伤|血肿|轻度裂伤|裂伤≤0.5)","(阴茎|会阴|阴囊|阴道|外阴)(NFS|挫伤|血肿|轻度裂伤|穿孔)","阴囊裂伤<25","睾丸(NFS|挫伤|血肿|轻度裂伤)","迷走神经损伤","棘间韧带裂伤","腰椎急性扭伤"],
                    '2':["肾上腺挫伤(重度|大面积)","肾上腺裂伤(重度|多处|深入髓质)","肛门(裂伤NFS|非全层裂伤)","膀胱(NFS|非全层裂伤|腹膜外裂伤)","(结肠|小肠)(NFS|挫伤|血肿|非全层裂伤|裂伤)","十二指肠浆膜撕裂","胆囊(NFS|挫伤|血肿|轻度|穿孔)","(肠系膜|网膜)(NFS|挫伤|血肿|轻度裂)","输卵管裂","卵巢(深部裂伤|裂伤>0.5cm|毁损|撕脱|广泛裂伤|复杂裂伤)","胰轻度(挫|裂|血肿)","阴茎(重度裂伤|广泛裂伤|离断|撕脱|复杂裂伤)","会阴重度裂伤","前列腺裂伤","直肠(NFS|挫伤|血肿|非全层裂伤|裂伤)","阴囊(重度裂伤|离断|撕脱|复杂裂伤)","胃(NFS|挫伤|血肿|非全层裂伤)","睾丸(撕脱|离断|广泛裂伤|复杂裂伤)","输尿管(NFS|挫伤|血肿|非全层裂伤)","尿道损伤","子宫(裂伤≤1|穿孔)","(阴道|外阴)(重度裂伤|深及脂肪或肌肉)","肾(NFS|轻度挫伤|包膜下血肿|皮质裂伤深度≤1cm且无漏尿|轻度裂伤)","腹膜后(出血|血肿)","(肝|脾)(NFS|轻度挫伤|包膜下血肿面积≤50%|包膜撕裂|轻度裂伤)","肝(实质内血肿直径≤10|实质裂伤深度≤3|实质裂伤长度≤10)","脾(实质内血肿直径≤5|实质裂伤深度≤3)；"],
                    '3':["肾上腺(撕脱|破裂|实质毁损>50|广泛裂伤|复杂裂伤)","肛门(穿孔|全层裂伤)","膀胱腹膜外裂伤>2","膀胱腹膜内(裂伤|破裂)","(结肠|小肠)(穿孔|全层裂伤|裂伤≥50)","十二指肠(上段|水平段|升段)裂伤","胆囊(撕脱|广泛裂伤|复杂裂伤|破裂|组织缺失)","胆囊管(裂伤|横断)","肠(系膜|网膜)(重度裂伤|失血>20)","胰(重度挫伤|大面积挫伤|广泛挫伤|管受累|中度裂伤|主要血管|主胰管受累|远端横断)","会阴(撕脱|广泛裂伤|复杂裂伤)","前列腺裂伤累及尿道","直肠(全层裂伤|裂伤>50)","胃(穿孔|全层裂伤|吞咽性损伤管壁)","输尿管(撕脱|广泛裂伤|复杂裂伤|破裂|组织缺失|横断)","尿道(横断|分离>2)","后尿道组织缺失","子宫裂伤>1","胎盘剥离≤50","(阴道|外阴)(撕脱|广泛裂伤|复杂裂伤)","阴道裂伤累及(子宫颈|腹膜)","肾(包膜下血肿|扩展性血肿|重度挫伤|大面积挫伤|皮质裂伤深度>1.*漏尿|中度裂伤)","(肝|脾)(包膜下血肿面积|扩展性血肿|实质破裂|重度挫伤|实质裂伤深度>3|中度裂伤)","(肝实质内血肿直径>10|主要肝管受累|肝失血>20)","脾(实质内血肿直径>5cm|破裂不累及脾门|小梁血管受累)"],
                    '4':["肛门(撕脱|广泛裂伤|复杂裂伤|破裂|大块组织缺损)","膀胱(撕脱|广泛裂伤|复杂裂伤|组织缺失).*累及(尿道口|膀胱三角|膀胱颈)","(结肠|小肠)(撕脱|广泛裂伤|复杂裂伤|组织缺失|横断|血供阻断)","十二指肠降段破裂>75.*累及(壶腹部|胆总管下段)","(胆总管|肝管)(裂伤|横断)","肠系膜(撕脱|广泛裂伤|复杂裂伤|组织缺失)","胰(重度裂伤|多处裂伤)累及(壶腹|近端横断)","胎盘(剥离>50|失血>20)","直肠裂伤延伸至会阴","胃(撕脱|破裂|广泛裂伤|复杂裂伤|组织缺失|血供中断|吞咽性损伤管壁全层坏死)","子宫裂伤累及子宫动脉","肾(裂伤延伸至皮质、髓质和集合系统|主要血管出血|重度裂伤|破裂)","脾重度裂伤","完全性马尾损伤综合征","脊髓挫伤致不全性脊髓损伤综合征"],
                    '5':["(十二指肠|直肠)(广泛裂伤|复杂裂伤|撕脱|组织缺失|血供阻断)","胰(撕脱|广泛裂伤|复杂裂伤|组织缺失|头毁损|十二指肠结合部毁损)","子宫(破裂|撕脱|血供阻断)","胎盘完全剥离","肾门撕脱","全肾毁损","全肾及血管毁损","脾(撕脱|广泛裂伤|组织缺失|门破裂致全脾血供阻断)"],
                    '6':["肝撕脱伤所有血管离断"]
                    },
                "其他":{
                    '1':["(腹|腰)穿透伤(NFS|浅表|轻度)","(腹|腰).{0,3}(外伤|扎伤|割伤)"],
                    '2':["穿透伤伴组织缺失>100","腹直肌哆裂NFS","髂(内|外)静脉(NFS|轻度|浅表裂伤|穿孔|穿刺)","神经根(NFS|挫伤|牵拉|单根裂伤|单根撕脱)","腰椎间盘(损伤NFS|突出|半脱位|脱位)","C.椎间盘突出","单侧小关节突(脱位|半脱位)","腰.{0,6}骨折","L.椎体骨折","脊柱骨折","椎体前部压缩≤20%","(棘突|横突|小关节突|椎板|椎弓根)骨折","腰.{0,5}椎体滑脱"],
                    '3':["穿透伤伴失血>20","(腹腔|肠系膜上)动脉(NFS|内膜撕裂)","(髂总|髂内|髂外|肝|肾|脾)动脉(NFS|内膜撕裂|轻度|浅表|穿孔|穿刺)","(髂总|下腔|门|肾|脾|肠系膜上)静脉(NFS|轻度|浅表|穿孔|穿刺)","髂(内|外)静脉(重度裂伤|破裂|完全横断|节段性缺损|失血>20)","(马尾|脊髓)(挫伤NFS|伴一过性神经体征|伴不全马尾损伤综合征)","多根神经根(裂伤|撕脱)","腰椎间盘突出伴神经根损伤","椎间盘破裂","双侧小关节突(脱位|半脱位)","腰.{0,3}椎体压缩.{0,3}骨折","腰椎压缩.{0,3}骨折","腰.{0,6}压缩.{0,3}骨折","L.椎体压缩.{0,3}骨折"],
                    '4':["腹主动脉(NFS|内膜撕裂)","(腹主|腹腔|肠系膜上)动脉(轻度|浅表|穿孔|穿刺伤)","(髂总|髂内|髂外|肝|肾|脾)动脉(重度裂伤|破裂|完全横断|节段性缺损|失血>20)","双侧髂总动脉损伤"],
                    '5':["(腹主|腹腔|肠系膜上)动脉(重度裂伤|破裂|完全横断|节段性缺损|失血>20)","脊髓挫伤致完全性脊髓损伤综合征","脊髓(裂伤NFS|穿透伤|横断|挤压)"],
                    '6':["躯干横断"]
                    }
            },
            "四肢":{
                "四肢":{
                    '1':["咬伤","(腕|手|肘|膝|髋|臂|腿|足).{0,6}(外伤|割伤|扎伤|刺伤|挫伤|锐器)","手指(部分|完全)离断","手指(挤压|浅表|轻度|穿透)","腋静脉NFS","(有静脉|贵要静脉|肘正中静脉)(NFS|轻度|浅表|穿孔|穿刺)","上肢动脉(NFS|内膜撕裂|轻度|浅表裂伤|穿孔|穿刺伤)","(指|趾)神经(NFS|挫|裂伤)","(正中|桡|尺|股|上肢)神经(NFS|挫伤|损伤)","胫神经挫伤","上肢关节囊(裂伤|破裂|撕裂|撕脱)","(肱|指).{0.6}肌肉(撕裂|撕脱|挫伤|扭伤|断裂)","(下肢|臀部|腿|足).{0,6}{肌肉部分(撕裂|撕脱|断裂)","(尺|指|冈上|肩|拇|上肢).{0,6}肌腱.{0,3}(撕裂|撕脱|断裂|损伤)","(肘以上|髋|膝|踝关节|臂|肩|上肢){0,6}(NFS|开放性损伤|开放伤|贯通|扭伤|半脱位|损伤)","(肘及以下|踝|下肢|趾).{0,6}(NFS|开放性损伤|扭伤|开放伤|贯通|半脱位|脱位)","(指|趾|腕).{0,6}(骨折|脱位)","(腕|手|肘|膝|髋|臂|腿|足).{0,6}(软组织|皮肤)(挫裂伤|缺损)"],
                    '2':["(手|拇指|足|趾)(部分|完全|不全)离断","骨筋膜室综合征","(手|拇指|足|趾)挤压伤","部分脱套伤","穿透伤伴组织缺失>25","(腋|肱|腘)动脉(NFS|内膜撕裂|轻度|浅表|穿孔|穿刺)","(腋|股|腘)静脉(轻度|浅表|穿孔|穿刺)","(正中|桡|尺|股|腓总|胫)神经(裂伤|撕脱)","(坐骨|腓总)神经(NFS|挫伤)","胫神经NFS","(跟腱|踝膝侧副韧带|交叉韧带|髌韧带|半月板).{0,6}(撕裂|撕脱|断裂|损伤)","(足|膝|腿|臀|趾|下肢|腕|股).{0,6}肌腱.{0,3}(撕裂|撕脱|断裂|损伤)","(下|臀部)肌肉完全(撕裂|撕脱)","(肘以上|桡|髋|膝|踝|肩|肘).{0,3}关节脱位","(四肢|手|腿|臂|踝|肱|跟|髌|锁|桡|腓|股|跖|胫|尺|掌|舟|胛|距).{0,6}骨折","骨盆(骨折|稳定骨折)","髋臼骨折"],
                    '3':["(肘以下至腕|膝以下至踝)(部分|完全)离断","骨筋膜室综合征伴肌肉坏死","(肘以下至腕|膝以下至踝)挤压伤","全(上|下)肢脱套伤","(肩至肘|肩至肘髋|臀至踝)穿透伤伴失血>20","(腋|肱|腘)静脉(重度裂伤|破裂|完全横断|节段性缺损|失血>20)","(腋|肱|腘)动静脉(重度裂伤|破裂|完全横断|节段性缺损|失血>20)","股动脉(NFS|内膜撕裂|轻度|浅表|穿孔|穿刺)","坐骨神经裂伤","肱骨开放性结节.*干骺端骨折","干骺端骨折.*肱骨开放性结节","(肱|桡|尺)骨开放性骨折","股骨骨折","胫骨开放骨折","双踝开放骨折","开放骨盆稳定骨折后环完好","骨盆骨折后环部分损伤","开放髋臼骨折","韧带损伤","(出血|失血).{0,3}休克"],
                    '4':["(肩至肘|肩至髋|臀至膝)(部分|完全)离断","(肩至肘|肩至髋|臀至膝)挤压","股动脉(重度裂伤|破裂|完全横断|节段性缺损|失血>20)","不稳定骨盆骨折(后环|盆底)(完全破坏|纵向不稳定)","开放骨盆骨折后环部分损伤"],
                    '5':["开放不稳定骨盆骨折(后环|盆底)(完全破坏|纵向不稳定)"],
                    '6':[]
                   } 
            },
            "体表":{
                "体表":{
                    '1':["皮肤缺损","头皮(NFS|擦|挫伤|裂)","帽状腱膜下血肿","(面部皮肤|皮下组织|肌肉|头部).{0,6}(NFS|擦|挫伤|血肿|裂)","(颈|胸|腹)部(皮肤|皮下组织|肌肉)(NFS|擦|挫伤|血肿)","(四肢|手部|腿部|手臂|臀部)(皮肤|皮下组织)(NFS|擦|挫伤|血肿)","烧伤MFS","冻伤浅表","原发低体温NFS"],
                    '2':["头皮(裂伤重度|撕脱伤重|组织缺失)","(面部皮肤|皮下组织|肌肉)(裂伤重度|撕脱伤重度|组织缺失)","(颈|胸|腹)部(皮肤|皮下组织|肌肉)(裂伤重度|撕脱伤重度|组织缺失)","(四肢|手部|腿部|手臂|臀部)(皮肤|皮下组织)(裂伤重度|撕脱伤重度|组织缺失)","冻伤(深度|全厚)","高压电击伤NFS"],
                    '3':["头皮失血>20","(面部皮肤|皮下组织|肌肉)失血>20","(颈|胸|腹)部(皮肤|皮下组织|肌肉)失血>20","(四肢|手部|腿部|手臂|臀部)(皮肤|皮下组织)失血>20","冻伤身体多处","窒息(NFS|无神经功能障碍)","溺水(NFS|接近溺死无神经功能障碍)","高压电击伤伴肌肉坏死"],
                    '4':["窒息伴神经功能障碍","接近溺死伴神经功能障碍"],
                    '5':["窒息伴心脏停搏","高压电击伤伴心脏停搏"],
                    '6':["溺水伴心脏停搏"]
                    }
                }
        }
    
    def get_critersions(self):
        return self.criterion
    
    def set_critersions(self, criterion):
        self.criterion = criterion